
$(function () {

    console.log("----------------------copyWithin()-------------------------");
    var a1 = [0,1,2,3,4,5,6,7,8,9];
    var a2 = a1.copyWithin(2,0,4);  //从索引2的位置开始被覆盖，从索引0的位置开始复制，复制长度为4
    console.log(a1);//Array [ 0, 1, 0, 1, 2, 3, 6, 7, 8, 9 ]说明，a1被覆盖了
    console.log(a2);//Array [ 0, 1, 0, 1, 2, 3, 6, 7, 8, 9 ]

    a1 = [0,1,2,3,4,5,6,7,8,9];
    a1.copyWithin(0,0); //从索引0开始被覆盖，从索引0开始复制，复制长度为数组整个长度
    console.log(a1);    // Array [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

    a1 = [0,1,2,3,4,5,6,7,8,9];
    a1.copyWithin(5,0); //从索引5开始被覆盖，从索引0开始复制，复制长度为数组整个长度
    console.log(a1);//Array [ 0, 1, 2, 3, 4, 0, 1, 2, 3, 4 ] ，发现索引5的位置开始被覆盖了，并且数组整个长度length并没有变动

    //总结：
    //先确定需要开始覆盖的位置索引target，然后再确定需要复制的数据的长度start与end.
    //数据覆盖会从target位置开始，具体覆盖的长度根据，选择复制数据的长度，
    //如果数组从target开始到数组最后元素的长度，大于选择复制数据的范围长度，那么被复制的长度就是end的长度。
    //如果数组从target开始到数组最后元素的长度，小于选择复制数据的范围长度，那么从target位置到数组最后的元素，
    // 有多少元素就覆盖多少元素



});
